HirokiIshiguro/rx72n-envision-kit/vendors/renesas/rx_driver_package/v125/r_flash_rx/src/r_flash_rx.c
/******************************************************************************
* Function Name: R_FlashCodeCopy
* Description  : Copies Flash driver code necessary for code flash program/erase
*                operations from ROM to RAM.
* Arguments    : none
* Return Value : none
******************************************************************************/
void R_FlashCodeCopy(void)
{
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)

#if ((FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0) || (FLASH_IN_DUAL_BANK_MODE == 1))
    uint8_t * p_rom_section;    // ROM source location
    uint8_t * p_ram_section;    // RAM copy destination
    uint32_t  bytes_copied;
#endif /* ((FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0) || (FLASH_IN_DUAL_BANK_MODE == 1)) */

#if defined(__CCRX__) || defined(__GNUC__)

#if (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0)
    R_BSP_SECTION_OPERATORS_INIT(RPFRAM)
    R_BSP_SECTION_OPERATORS_INIT(PFRAM)
#endif /* (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0) */
#ifdef FLASH_IN_DUAL_BANK_MODE
    R_BSP_SECTION_OPERATORS_INIT(RPFRAM2)
    R_BSP_SECTION_OPERATORS_INIT(PFRAM2)
#endif /* FLASH_IN_DUAL_BANK_MODE */

#if (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0)
    /* Initialize pointers */
    p_ram_section = (uint8_t *)R_BSP_SECTOP(RPFRAM);
    p_rom_section = (uint8_t *)R_BSP_SECTOP(PFRAM);

    /* Copy code from ROM to RAM. */
    for (bytes_copied = 0; bytes_copied < R_BSP_SECSIZE(PFRAM); bytes_copied++)
    {
        p_ram_section[bytes_copied] = p_rom_section[bytes_copied];
    }
#endif /* (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0) */

#ifdef FLASH_IN_DUAL_BANK_MODE
    uart_string_printf_immediate( "diag: R_FlashCodeCopy PFRAM2 start\r\n" );
    /* Initialize pointers */
    p_ram_section = (uint8_t *)R_BSP_SECTOP(RPFRAM2);
    p_rom_section = (uint8_t *)R_BSP_SECTOP(PFRAM2);

    /* Copy code from ROM to RAM. */
    for (bytes_copied = 0; bytes_copied < R_BSP_SECSIZE(PFRAM2); bytes_copied++)
    {
        p_ram_section[bytes_copied] = p_rom_section[bytes_copied];
    }
    uart_string_printf_immediate( "diag: R_FlashCodeCopy PFRAM2 ok\r\n" );
#endif /* FLASH_IN_DUAL_BANK_MODE */

#elif defined(__ICCRX__)

#if (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0)
    R_BSP_SECTION_OPERATORS_INIT(PFRAM)
    R_BSP_SECTION_OPERATORS_INIT(PFRAM_init);
#endif /* (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0) */
#ifdef FLASH_IN_DUAL_BANK_MODE
    R_BSP_SECTION_OPERATORS_INIT(PFRAM2)
    R_BSP_SECTION_OPERATORS_INIT(PFRAM2_init);
#endif /* FLASH_IN_DUAL_BANK_MODE */

#if (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0)
    /* Initialize pointers */
    p_ram_section = (uint8_t *) R_BSP_SECTOP(PFRAM);
    p_rom_section = (uint8_t *) R_BSP_SECTOP(PFRAM_init);

    /* Copy code from ROM to RAM. */
#if defined(__LIT)
    for (bytes_copied = 0; bytes_copied < R_BSP_SECSIZE(PFRAM_init); bytes_copied++)
    {
        p_ram_section[bytes_copied] = p_rom_section[bytes_copied];
    }
#elif defined(__BIG)
    for (bytes_copied = 0; bytes_copied < R_BSP_SECSIZE(PFRAM_init); bytes_copied+=4)
    {
        /* Copy over data 4 byte at a time. */
        p_ram_section[bytes_copied]   = p_rom_section[bytes_copied+3];
        p_ram_section[bytes_copied+1] = p_rom_section[bytes_copied+2];
        p_ram_section[bytes_copied+2] = p_rom_section[bytes_copied+1];
        p_ram_section[bytes_copied+3] = p_rom_section[bytes_copied];
    }
#endif /* defined(__LIT) */
#endif /* (FLASH_CFG_CODE_FLASH_RUN_FROM_ROM == 0) */

#ifdef FLASH_IN_DUAL_BANK_MODE
    /* Initialize pointers */
    p_ram_section = (uint8_t *)R_BSP_SECTOP(PFRAM2);
    p_rom_section = (uint8_t *)R_BSP_SECTOP(PFRAM2_init);

    /* Copy code from ROM to RAM. */
#if defined(__LIT)
    for (bytes_copied = 0; bytes_copied < R_BSP_SECSIZE(PFRAM2_init); bytes_copied++)
    {
        p_ram_section[bytes_copied] = p_rom_section[bytes_copied];
    }
#elif defined(__BIG)
    for (bytes_copied = 0; bytes_copied < R_BSP_SECSIZE(PFRAM2_init); bytes_copied+=4)
    {
        /* Copy over data 4 byte at a time. */
        p_ram_section[bytes_copied]   = p_rom_section[bytes_copied+3];
        p_ram_section[bytes_copied+1] = p_rom_section[bytes_copied+2];
        p_ram_section[bytes_copied+2] = p_rom_section[bytes_copied+1];
        p_ram_section[bytes_copied+3] = p_rom_section[bytes_copied];
    }
#endif /* defined(__LIT) */
#endif /* FLASH_IN_DUAL_BANK_MODE */

#endif /* defined(__CCRX__) || defined(__GNUC__) */

#endif /* (FLASH_CFG_CODE_FLASH_ENABLE == 1) */
}


/***********************************************************************************************************************
 * Function Name: R_FLASH_Close
 *******************************************************************************************************************//**
 * @brief   The function closes the Flash FIT module.
 * @retval  FLASH_SUCCESS  Flash FIT module closed successfully.
 * @retval  FLASH_ERR_BUSY A different flash process is being executed, try again later.
 * @details This function closes the Flash FIT module.
 *          It disables the flash interrupts (if enabled) and sets the driver to an uninitialized state.
 */
flash_err_t R_FLASH_Close(void)
{
    return(r_flash_close());
}



/* FUNCTIONS WHICH MUST BE RUN FROM RAM FOLLOW */
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#define FLASH_PE_MODE_SECTION    R_BSP_ATTRIB_SECTION_CHANGE(P, FRAM)
#define FLASH_SECTION_CHANGE_END R_BSP_ATTRIB_SECTION_CHANGE_END
#else
#define FLASH_PE_MODE_SECTION
#define FLASH_SECTION_CHANGE_END
#endif

/***********************************************************************************************************************
 * Function Name: R_FLASH_Erase
 *******************************************************************************************************************//**
 * @brief     This function is used to erase the specified block in code flash or data flash.
 * @param[in] block_start_address Specifies the start address of block to erase.
 *                                The enum flash_block_address_t is defined in the corresponding MCU's
 *                                r_flash_rx\src\targets\mcu\r_flash_mcu.h file.
 *                                The blocks are labeled in the same fashion as they are
 *                                in the device's Hardware Manual.
 *                                For example, the block located at address 0xFFFFC000 is called Block 7
 *                                in the RX113 hardware manual, therefore "FLASH_CF_BLOCK_7" should be passed
 *                                for this parameter. 
 *                                Similarly, to erase Data Flash Block 0 which is located at address 0x00100000,
 *                                this argument should be FLASH_DF_BLOCK_0.
 * @param[in] num_blocks          Specifies the number of blocks to be erased.
 *                                For type 1 parts, address + num_blocks cannot cross a 256K boundary.
 * @retval    FLASH_SUCCESS       Operation successful.
 *                                (if non-blocking mode is enabled, this means the operation was started successfully).
 * @retval    FLASH_ERR_BLOCKS    Invalid number of blocks specified.
 * @retval    FLASH_ERR_ADDRESS   Invalid address specified.
 * @retval    FLASH_ERR_BUSY      A different flash process is being executed, or the module is not initialized.
 * @retval    FLASH_ERR_FAILURE   Erasing failure. Sequencer has been reset.
 *                                Or callback function not registered (in non-blocking mode)
 * @details   Erases a contiguous number of code flash or data flash memory blocks.
 *            The block size varies depending on MCU types.
 *            For example, on the RX111 both code and data flash block sizes are 1Kbytes.
 *            On the RX231 and RX23T the block size for code flash is 2 Kbytes and for data flash is 1Kbyte
 *            (no data flash on the RX23T).
 *            The equates FLASH_CF_BLOCK_SIZE for code flash and FLASH_DF_BLOCK_SIZE
 *            for data flash are provided for these values.
 *            The enum flash_block_address_t is configured at compile time based on the memory configuration of
 *            the MCU device specified in the r_bsp module.
 *            When the API is used in non-blocking mode,
 *            the FRDYI interrupt occurs after blocks for the specified number are erased,
 *            and then the callback function is called.
 * @note      In order to erase a code flash block, the area to be erased needs to be in a rewritable area.
 *            FLASH_TYPE_1 uses access windows to identify this.
 *            The other flash types use lock bits which must be off for erasing.
 */
FLASH_PE_MODE_SECTION
flash_err_t R_FLASH_Erase(flash_block_address_t block_start_address, uint32_t num_blocks)
{
    return(r_flash_erase(block_start_address, num_blocks));
}

#ifndef FLASH_NO_BLANK_CHECK
/***********************************************************************************************************************
 * Function Name: R_FLASH_BlankCheck
 *******************************************************************************************************************//**
 * @brief      This function is used to determine if the specified area in either code flash or data flash
 *             is blank or not.
 * @param[in]  address            The address of the area to blank check.
 * @param[in]  num_bytes          This is the number of bytes to be checked.
 *                                The number of bytes specified must be a multiple of FLASH_DF_MIN_PGM_SIZE
 *                                for a data flash address or FLASH_CF_MIN_PGM_SIZE for a code flash address.
 *                                These equates are defined in r_flash_rx\src\targets\<mcu>\r_flash_<mcu>.h
 *                                and are MCU specific.
 *                                For type 1 parts, address + num_bytes cannot cross a 256K boundary.
 * @param[out] blank_check_result In blocking mode, specify the memory address to which the blank check results will be
 *                                stored. In non-blocking mode, specify any value since this parameter is not used.
 * @retval     FLASH_SUCCESS      Operation successful.
 *                                (in non-blocking mode, this means the operation was started successfully)
 * @retval     FLASH_ERR_FAILURE  Blank check failed. Sequencer has been reset, or callback function not registered.
 *                                (in non-blocking mode)
 * @retval     FLASH_ERR_BUSY     A different flash process is being executed or the module is not initialized.
 * @retval     FLASH_ERR_BYTES    num_bytes was either too large or not a multiple of the minimum programming size
 *                                or exceed the maximum range.
 * @retval     FLASH_ERR_ADDRESS  Invalid address was input or address not divisible by the minimum programming size.
 * @retval     FLASH_ERR_NULL_PTR blank_check_result for storing blank check results was NULL.
 * @details    The flash area to write the program into must be blank.
 *             The result of the blank check operation is placed into "blank_check_result"
 *             when operation is in blocking mode.
 *             This variable is of type flash_res_t which is defined in r_flash_rx_if.h..
 *             If the API is used in non-blocking mode,
 *             the result of the blank check is passed as the argument of the callback function
 *             after the blank check is complete.
 */
FLASH_PE_MODE_SECTION
flash_err_t R_FLASH_BlankCheck(uint32_t address, uint32_t num_bytes, flash_res_t *blank_check_result)
{
    return(r_flash_blankcheck(address, num_bytes, blank_check_result));
}

#endif


